{
    "work" : [
        {
            "img" : "static/img/work/work-1-content.png",
            "title" : "Mead Johnson Corporate Site",
            "client" : "Mead Johnson",
            "role" : "Developer",
            "platform" : "Website",
            "link" : "http://www.meadjohnson.com",
            "summary" : [
                "Mead Johnson came to Trapeze looking for a change in their corporate website. They weren't looking for a change in branding, or even changes in their websites design and structure. What they needed was an update in their technologies. This included an updated CMS, a responsive designed website and modules that run without a flash dependency.",
                "As a developer on this project I quickly learned the ins and outs of the Drupal CMS. There were some things we weren't able to do from their old site due to Drupal's limitations. Overall, the responsive design worked perfectly and most Flash modules were able to be converted into an HTML/CSS/JS solution."
            ]
        },
        {
            "img" : "static/img/work/work-2-content.png",
            "title" : "Kraft Hockeyville 2015",
            "client" : "Kraft Canada",
            "role" : "Developer",
            "platform" : "Web Contest",
            "link" : "http://www.khv2015.ca",
            "summary" : [
                "Kraft has been running the Kraft Hockeyville program for almost a decade. In the contest people from across Canada nominate their communities for a chance to win upgrades to their local hockey arena. The contest runs in phases. First, a community member fills out a form in order to nominate thier community. Next the community rallies around their nomination through social media with the use of a custom hashtag. Next, Kraft chooses their top 10 best nominations. Then, we entered the voting phase where the communities can vote for themselves an infinite amount of times. This was the most intense phase as we had around 100,000 hits to the site per day. Finally, there is a second round of voting between the top 2 where the winner wins $100,000 and an NHL pre-season game played in their community.",
                "There were many difficult aspects to this project. The site was responsive of course, but majority of the content was user driven. We as developers had to account for all possible image sizes, users could upload youtube videos of their communities and many other things. Also, with each phase change the content on the site and design of the site changed. This was acheived with an extensive Django backend that swapped out templates based on a timeline. In order to keep voting smooth and avoid hits bringing the site down, the voting process was all ajax. This allowed us to have users vote infinitely without having a page reload everytime."
            ]
        },
        {
            "img" : "static/img/work/work-3-content.png",
            "title" : "Build Force",
            "client" : "Build Force",
            "role" : "Designer/Developer",
            "platform" : "Web App",
            "link" : null,
            "summary" : [
                "Build Force came to EdCetra Training in search of a new e-learning course. Their business had gone through a rebranding and their flash based e-learning course was out of date. Build Force wanted a new e-learning course that was redesigned to suit their brand and also had their previous flash modules trnaslated to html/css/js based responsive design.",
                "Because EdCetra was such a small business, I was in charge a both design and development of the project. I used their brand colours for most of the UI with elements of blueprints and construction. As a developer there wasn't a flash module I couldn't transfer to 'flashless'."
            ]
        },
        {
            "img" : "static/img/work/work-4-content.png",
            "title" : "Anan Cloud Corporate Site",
            "client" : "Anan Cloud",
            "role" : "Designer/Developer",
            "platform" : "Website",
            "link" : "http://www.anancloud.com",
            "summary" : [
                "Anan Cloud is a web service similar to Slide Share. Users can upload their ppt presentations to a cloud storage service. From their they can search through their presentations and thousands of others, select individual slides and create new prentations with those slides.",
                "I designed and developed the user interface of the logged in side of Anan Cloud. I was also tasked with building the responsive portion of the website. This was my first foray into responsive design, both as a designer and a developer. For a junior developer at the time, it was a fantastic learning experience"
            ]
        },
        {
            "img" : "static/img/work/work-5-content.png",
            "title" : "Three.js Solar System Experiment",
            "client" : "Personal",
            "role" : "Creator",
            "platform" : "Web App",
            "link" : "http://www.beldhamdesign.com/SolarSystem",
            "summary" : [
                "I was always interested in what three.js had to offer. I had known about it and admired what it could do since it's inception in 2009. However I never had the proper understanding of javascript in order to build something with it.",
                "Five years later, with a lot more javascript experience, I had decided to give Three.js another go. I had seen an experiment online with a model of the milky way galaxy, so I decided to create my own model of the Solar System as a personal experiment. The size of the planets and The Sun are to scale. The distance between the planets are a quarter scale. This project to me personally was very satisfying as it showed me how much my skills have improved in five years."
            ]
        },
        {
            "img" : "static/img/work/work-6-content.png",
            "title" : "Slide Jar Logo",
            "client" : "SlideJar",
            "role" : "Designer",
            "platform" : "Branding",
            "link" : null,
            "summary" : [
                "ncw ejrk w chjr wek rhew kc rje whc rwk chre wjckr ewhc rhc wkj crhe whc rkwe cjre wchr wkchrej hcwe hckjwer hc krew chrkw cher jcr whejkc jhrew khcr hewk crhj ewhjcr kjew rhjkw her jkew chr cekwh rhjkwe",
                "ncw ejrk w chjr wek rhew kc rje whc rwk chre wjckr ewhc rhc wkj crhe whc rkwe cjre wchr wkchrej hcwe hckjwer hc krew chrkw cher jcr whejkc jhrew khcr hewk crhj ewhjcr kjew rhjkw her jkew chr cekwh rhjkwe",
                "ncw ejrk w chjr wek rhew kc rje whc rwk chre wjckr ewhc rhc wkj crhe whc rkwe cjre wchr wkchrej hcwe hckjwer hc krew chrkw cher jcr whejkc jhrew khcr hewk crhj ewhjcr kjew rhjkw her jkew chr cekwh rhjkwe"
            ]
        }
    ]
}